In [1]:
import pandas as pd

In [2]:
cd = pd.read_csv('supershops.csv')

In [3]:
cd.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# normalization

In [4]:
from sklearn.preprocessing import MinMaxScaler

In [5]:
m = MinMaxScaler()

In [6]:
cd_mar = m.fit (cd[['Marketing Spend']])

In [7]:
cd.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [8]:
cd[['Marketing Spend']] = m.transform(cd[['Marketing Spend']])

In [9]:
cd.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

# fit & transform

In [10]:
cd[['Administration']] = m.fit_transform(cd[['Administration']])   #fit & transform

In [11]:
cd.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [12]:
x = cd.drop('Profit', axis=1)
y = cd[['Profit']]

In [13]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744  471784.10    Dhaka
1         0.983359        0.761972  443898.53      Ctg
2         0.927985        0.379579  407934.54  Rangpur
3         0.873136        0.512998  383199.62    Dhaka
4         0.859438        0.305328  366168.42  Rangpur

In [14]:
x1 = x.copy()
x2 = x.copy()
x3 = x.copy()
x4 = x.copy()

# MinMaxScaler using for loop

In [15]:
for z in x.columns:                                            
    if pd.api.types.is_numeric_dtype(x[z]):               
        x[z] = m.fit_transform(x[[z]])
        continue

In [16]:
print(x.head())

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

# Standard Scaler

In [17]:
from sklearn.preprocessing import StandardScaler

In [18]:
s = StandardScaler()

In [19]:
cd[['Marketing Spend']] = s.fit_transform(cd[['Marketing Spend']])

In [20]:
cd.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.651744  471784.10    Dhaka  192261.83
1         1.955860        0.761972  443898.53      Ctg  191792.06
2         1.754364        0.379579  407934.54  Rangpur  191050.39
3         1.554784        0.512998  383199.62    Dhaka  182901.99
4         1.504937        0.305328  366168.42  Rangpur  166187.94

# using for loop

In [21]:
for z in x2.columns:                                            
    if pd.api.types.is_numeric_dtype(x2[z]):               
        x2[z] = m.fit_transform(x2[[z]])
        continue

In [22]:
print(x2.head())

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

# MaxAbsScaler

In [23]:
from sklearn.preprocessing import MaxAbsScaler
mas = MaxAbsScaler()

In [24]:
cd[['Marketing Spend']] = mas.fit_transform(cd[['Marketing Spend']])

In [25]:
cd.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.445303        0.651744  471784.10    Dhaka  192261.83
1         0.969971        0.761972  443898.53      Ctg  191792.06
2         0.870043        0.379579  407934.54  Rangpur  191050.39
3         0.771065        0.512998  383199.62    Dhaka  182901.99
4         0.746344        0.305328  366168.42  Rangpur  166187.94

# using for loop

In [26]:
x3.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744  471784.10    Dhaka
1         0.983359        0.761972  443898.53      Ctg
2         0.927985        0.379579  407934.54  Rangpur
3         0.873136        0.512998  383199.62    Dhaka
4         0.859438        0.305328  366168.42  Rangpur

In [27]:
for z in x3.columns:
    if pd.api.types.is_numeric_dtype(x3[z]):
        x3[z] = s.fit_transform(x3[[z]])
        continue

In [28]:
print(x3.head())

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

# Robust Scaler

In [29]:
from sklearn.preprocessing import RobustScaler
rs =  RobustScaler()

In [30]:
cd[['Transport']] = rs.fit_transform(cd[['Transport']])

In [31]:
cd.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.445303        0.651744   1.552016    Dhaka  192261.83
1         0.969971        0.761972   1.383714      Ctg  191792.06
2         0.870043        0.379579   1.166654  Rangpur  191050.39
3         0.771065        0.512998   1.017368    Dhaka  182901.99
4         0.746344        0.305328   0.914576  Rangpur  166187.94

# Using For Loop

In [32]:
x4.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744  471784.10    Dhaka
1         0.983359        0.761972  443898.53      Ctg
2         0.927985        0.379579  407934.54  Rangpur
3         0.873136        0.512998  383199.62    Dhaka
4         0.859438        0.305328  366168.42  Rangpur

In [33]:
for z in x4.columns:
    if pd.api.types.is_numeric_dtype(x4[z]):
        x4[z] = rs.fit_transform(x4[[z]])
        continue

In [34]:
print(x4.head())

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur